## Issue

1. Sub-Group2 메뉴 DB에 저장할지 안할지 판단

   ⇒ Sprint1 에서 카테고리 별 메뉴를 DB에 저장할 때 백엔드와 DB에 대한 설정이 완벽하게 되지 않았다. 따라서 Subgroup2에서 메인 메뉴가 얼마 되지 않는다고 판단하여 프론트에 올리고 Subgroup1에서 DB 설계와 백엔드 연결을 확실히 설정하기로 결정하였다.

2. Javascript vs Typescript

   ⇒ 처음엔 Javascript 환경으로 프로젝트를 설정하였지만 개발 시 타입 추론에 용이하여 Subgroup 간의 협업에 도움을 주는 Typescript로 변경하기로 결정하였다.

3. Script 실행 시 루트가 아닌 디렉토리에서 시작

   ⇒ [http://localhost:3000/](http://localhost:3000/) 가 아닌 [http://localhost:3000/2021-HandsOn-Project/](http://localhost:3000/2021-HandsOn-Project/) 에서 시작하여 라우팅이 작동하지 않았다. Subgroup1의 기능을 main에 merge한 후에 발생한 이슈임이 확인되어 살펴보니 github page로 배포하는 과정에서 package.json에 homepage 속성을 주어 로컬에서 실행 시 다른 해당 속성을 따라 다른 디렉토리에서 시작함을 발견하였다. 따라서 해당 속성을 다시 루트로 바꾸어 이슈를 해결하였다.

## Function

1. 현장 결제 삭제

   ⇒ 설계 단계에서 현장 결제와 온라인 결제 모두를 고려하였지만 현장 결제를 허용할 경우 온라인 주문 시스템을 사용한 사람과 키오스크를 사용한 사람에 대한 구분이 필요하여 오히려 매장에 혼선을 줄 수 있다는 의견이 있어 현장 결제 기능을 삭제하고 온라인 결제 기능만 남겨두기로 하였다.

2. 회원 정보 전화번호 필요성

   ⇒ 기존에는 현장 결제, 온라인 결제 모두 생각하여 현장 결제 시 허위 주문을 막기 위해 이용자의 번호를 수집하기로 결정하였다. 하지만 결제 시스템에 대한 교수님과 팀원들 간의 논의 후 다른 회사의 솔루션을 사용하는 방법이 채택되어 본인 인증의 필요성이 없어졌고 현장 결제 삭제로 허위 주문에 대해 고려할 필요가 없어졌기에 Sprint 2에서 이에 대한 기능을 삭제하기로 하였다.
